<a href="https://colab.research.google.com/github/AiBiC-Data/database/blob/main/week9.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from sqlalchemy import create_engine
my_conn = create_engine("sqlite:////content/my_db.db/")

#Show the list of talbes
r_set = my_conn.execute('''select name from sqlite_master where type = 'table' ''')
for row in r_set:
  print(row)

('category',)
('subcategory',)
('student',)

In [2]:
from sqlalchemy.exc import SQLAlchemyError
try:
  my_conn.execute('''DROP table student;''')
  print("student table deleted")
except SQLAlchemyError as e:
  error = str(e._dict_['orig'])
  print(error)
  #print(e)

student table deleted

In [3]:
from sqlalchemy import create_engine
my_conn = create_engine("sqlite:////content/my_db.db/")

#Show the list of talbes
r_set = my_conn.execute('''select name from sqlite_master where type = 'table' ''')
for row in r_set:
  print(row)

('category',)
('subcategory',)

In [4]:
#Open file and run script,
with open("student_tables.sql", "r") as file:
  query = file.read()
  my_conn.execute(query)

#Show the list of tables
r_set = my_conn.execute("SELECT name FROM sqlite_master WHERE type='table';")
for row in r_set:
  print(row)

('category',)
('subcategory',)
('student',)

In [5]:
with open("student_insert.sql", "r") as file:
  query = file.read()
  my_conn.execute(query)

r_set = my_conn.execute('''SELECT * FROM student''');
for row in r_set:
  print(row)

(1, 'John Deo', 'Four', 75, 'female')
(2, 'Max Ruin', 'Three', 85, 'male')
(3, 'Arnold', 'Three', 55, 'male')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(7, 'My John Rob', 'Five', 78, 'male')
(8, 'Asruid', 'Five', 85, 'male')
(9, 'Tes Qry', 'Six', 78, 'male')
(10, 'Big John', 'Four', 55, 'female')
(11, 'Ronald', 'Six', 89, 'female')
(27, 'Big Nose', 'Three', 81, 'female')
(28, 'Rojj Base', 'Seven', 86, 'female')
(29, 'Tess Played', 'Seven', 55, 'male')
(30, 'Reppy Red', 'Six', 79, 'female')
(31, 'Marry Toeey', 'Four', 88, 'male')
(32, 'Binn Rott', 'Seven', 90, 'female')
(33, 'Kenn Rein', 'Six', 96, 'female')
(34, 'Gain Toe', 'Seven', 69, 'male')
(35, 'Rows Noump', 'Six', 88, 'female')

In [6]:
from sqlalchemy.exc import SQLAlchemyError
q= "UPDATE student SET mark=mark+1"
try:
  r_set = my_conn.execute(q)
except SQLAlchemyError as e:
  error= str(e.__dict__['orig'])
  print(error)
else:
  print("No of records updated : ", r_set.rowcount)

No of records updated :  20

In [7]:
r_set = my_conn.execute('''SELECT * FROM student''');
for row in r_set:
  print(row)

(1, 'John Deo', 'Four', 76, 'female')
(2, 'Max Ruin', 'Three', 86, 'male')
(3, 'Arnold', 'Three', 56, 'male')
(4, 'Krish Star', 'Four', 61, 'female')
(5, 'John Mike', 'Four', 61, 'female')
(6, 'Alex John', 'Four', 56, 'male')
(7, 'My John Rob', 'Five', 79, 'male')
(8, 'Asruid', 'Five', 86, 'male')
(9, 'Tes Qry', 'Six', 79, 'male')
(10, 'Big John', 'Four', 56, 'female')
(11, 'Ronald', 'Six', 90, 'female')
(27, 'Big Nose', 'Three', 82, 'female')
(28, 'Rojj Base', 'Seven', 87, 'female')
(29, 'Tess Played', 'Seven', 56, 'male')
(30, 'Reppy Red', 'Six', 80, 'female')
(31, 'Marry Toeey', 'Four', 89, 'male')
(32, 'Binn Rott', 'Seven', 91, 'female')
(33, 'Kenn Rein', 'Six', 97, 'female')
(34, 'Gain Toe', 'Seven', 70, 'male')
(35, 'Rows Noump', 'Six', 89, 'female')

In [8]:
from sqlalchemy.exc import SQLAlchemyError
q = "UPDATE student SET mark = mark+1 WHERE id=7"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("NO of records updated : ", r_set.rowcount)

NO of records updated :  1

In [9]:
r_set = my_conn.execute('''SELECT * FROM student''');
for row in r_set:
  print(row)

(1, 'John Deo', 'Four', 76, 'female')
(2, 'Max Ruin', 'Three', 86, 'male')
(3, 'Arnold', 'Three', 56, 'male')
(4, 'Krish Star', 'Four', 61, 'female')
(5, 'John Mike', 'Four', 61, 'female')
(6, 'Alex John', 'Four', 56, 'male')
(7, 'My John Rob', 'Five', 80, 'male')
(8, 'Asruid', 'Five', 86, 'male')
(9, 'Tes Qry', 'Six', 79, 'male')
(10, 'Big John', 'Four', 56, 'female')
(11, 'Ronald', 'Six', 90, 'female')
(27, 'Big Nose', 'Three', 82, 'female')
(28, 'Rojj Base', 'Seven', 87, 'female')
(29, 'Tess Played', 'Seven', 56, 'male')
(30, 'Reppy Red', 'Six', 80, 'female')
(31, 'Marry Toeey', 'Four', 89, 'male')
(32, 'Binn Rott', 'Seven', 91, 'female')
(33, 'Kenn Rein', 'Six', 97, 'female')
(34, 'Gain Toe', 'Seven', 70, 'male')
(35, 'Rows Noump', 'Six', 89, 'female')

In [12]:
from sqlalchemy.exc import SQLAlchemyError
id = input("enter student id: ")
my_data = (id,)
q = "UPDATE student SET mark= mark+5 WHERE id=?"
try:
  r_set=my_conn.execute(q,my_data)
except SQLAlchemyError as e:
  error = str(e.__dict__['orig'])
  print(error)
else:
  print("No of records updated : ", r_set.rowcount)

enter student id: 11
No of records updated :  1

In [13]:
from sqlalchemy.exc import SQLAlchemyError
q = "SELECT DISTINCT(class) FROM student"
try:
  r_set=my_conn.execute(q)
  data = r_set.fetchall()
  for row in data:
    print(row[0])
except SQLAlchemtError as e:
  error = str(e._dict__['orig'])
  print(error)
else:
  print("No of records displayed : ", len(data))

Four
Three
Five
Six
Seven
No of records displayed :  5

In [14]:
from sqlalchemy.exc import SQLAlchemyError
q = "SELECT DISTINCT(class) FROM student WHERE mark>=80"
try:
  r_set=my_conn.execute(q)
  data = r_set.fetchall()
  for row in data:
    print(row[0])
except SQLAlchemtError as e:
  error = str(e._dict__['orig'])
  print(error)
else:
  print("No of records displayed : ", len(data))

Three
Five
Six
Seven
Four
No of records displayed :  5

In [15]:
from sqlalchemy.exc import SQLAlchemyError
q = "SELECT DISTINCT(class) FROM student order by class"
try:
  r_set=my_conn.execute(q)
  data = r_set.fetchall()
  for row in data:
    print(row[0])
except SQLAlchemyError as e:
  error = str(e._dict__['orig'])
  print(error)
else:
  print("No of records displayed : ", len(data))

Five
Four
Seven
Six
Three
No of records displayed :  5

In [19]:
from sqlalchemy.exc import SQLAlchemyError
q = "SELECT DISTINCT class,sex FROM student order by class"
try:
  r_set=my_conn.execute(q)
  data = r_set.fetchall()
  for row in data:
    print(row[0], row[1])
except SQLAlchemyError as e:
  error = str(e.__dict__['orig'])
  print(error)
else:
  print("No of records displayed : ", len(data))

Five male
Four female
Four male
Seven female
Seven male
Six male
Six female
Three male
Three female
No of records displayed :  9